-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: mariadb:3306
-- Generation Time: Jun 08, 2025 at 10:43 AM
-- Server version: 11.4.5-MariaDB-ubu2404
-- PHP Version: 8.2.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `score_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `score`
--

CREATE TABLE `score` (
  `student_id` bigint(10) DEFAULT NULL,
  `student_pw` varchar(6) DEFAULT NULL,
  `fullname` varchar(20) DEFAULT NULL,
  `exam1` int(2) DEFAULT NULL,
  `exam2` int(2) DEFAULT NULL,
  `exam3` int(2) DEFAULT NULL,
  `exam4` int(2) DEFAULT NULL,
  `exam5` int(2) DEFAULT NULL,
  `exam6` int(2) DEFAULT NULL,
  `exam7` int(2) DEFAULT NULL,
  `exam8` int(2) DEFAULT NULL,
  `exam9` int(2) DEFAULT NULL,
  `exam10` int(2) DEFAULT NULL,
  `sum` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf32 COLLATE=utf32_thai_520_w2;

--
-- Dumping data for table `score`
--

INSERT INTO `score` (`student_id`, `student_pw`, `fullname`, `exam1`, `exam2`, `exam3`, `exam4`, `exam5`, `exam6`, `exam7`, `exam8`, `exam9`, `exam10`, `sum`) VALUES
(6510615001, 'Tse001', 'สมชาย ใจดี', 3, 10, 10, 5, 2, 10, 10, 8, 4, 9, 71),
(6510615002, 'Tse002', 'กนกวรรณ สุขสันต์', 2, 6, 8, 9, 9, 2, 4, 10, 3, 10, 63),
(6510615003, 'Tse003', 'พรพิมล เก่งฉลาด', 3, 3, 0, 2, 1, 0, 8, 4, 9, 7, 37),
(6510615004, 'Tse004', 'สิริลักษณ์ อ่อนหวาน', 9, 1, 2, 7, 8, 0, 1, 7, 2, 8, 45),
(6510615005, 'Tse005', 'อนุชา กล้าหาญ', 6, 10, 0, 4, 2, 3, 0, 4, 6, 5, 40),
(6510615006, 'Tse006', 'วิไลวรรณ สวยงาม', 2, 6, 10, 8, 4, 8, 9, 9, 0, 3, 59),
(6510615007, 'Tse007', 'ธนวัฒน์ แสนสุข', 1, 10, 10, 2, 7, 0, 6, 8, 0, 4, 48),
(6510615008, 'Tse008', 'สุชาดา นุ่มนวล', 9, 7, 8, 6, 5, 5, 9, 2, 7, 10, 68),
(6510615009, 'Tse009', 'ณัฐพล มั่นคง', 4, 1, 9, 4, 0, 6, 2, 0, 4, 3, 33),
(6510615010, 'Tse010', 'ปรียานุช สดใส', 5, 10, 5, 10, 6, 7, 7, 5, 10, 8, 73),
(6510615011, 'Tse011', 'วีรยุทธ เกรียงไกร', 5, 4, 1, 5, 1, 6, 8, 10, 8, 7, 55),
(6510615012, 'Tse012', 'สุธิดา อบอุ่น', 9, 8, 6, 6, 10, 3, 6, 9, 6, 4, 67),
(6510615013, 'Tse013', 'ณัฏฐณิชา งามเลิศ', 3, 5, 7, 6, 0, 10, 9, 10, 6, 4, 60),
(6510615014, 'Tse014', 'ธีรเดช สุขใจ', 6, 9, 8, 10, 3, 1, 7, 5, 4, 5, 58),
(6510615015, 'Tse015', 'วรรณวิสา เปรมปรีดิ์', 2, 10, 7, 8, 6, 4, 9, 3, 1, 1, 51),
(6510615016, 'Tse016', 'ปวีณา สุขใจ', 8, 3, 6, 3, 5, 6, 2, 10, 10, 8, 61),
(6510615017, 'Tse017', 'เกียรติศักดิ์ มหาศาล', 1, 1, 3, 4, 1, 4, 10, 10, 8, 10, 52),
(6510615018, 'Tse018', 'จิราภรณ์ สุขสวัสดิ์', 5, 3, 1, 8, 4, 4, 1, 4, 0, 0, 30),
(6510615019, 'Tse019', 'ศิริลักษณ์ ใจเย็น', 2, 2, 4, 8, 10, 9, 0, 2, 3, 7, 47),
(6510615020, 'Tse020', 'อนุรักษ์ เกื้อกูล', 5, 3, 2, 2, 7, 10, 2, 2, 5, 1, 39),
(6510615021, 'Tse021', 'พิมพ์พรรณ ระเบียบ', 1, 3, 4, 6, 4, 4, 4, 10, 0, 5, 41),
(6510615022, 'Tse022', 'วิศวะ ฉลาดเฉลียว', 7, 9, 2, 9, 0, 1, 5, 6, 8, 2, 49),
(6510615023, 'Tse023', 'ณัฐวุฒิ สมบูรณ์', 6, 9, 6, 4, 1, 3, 4, 10, 3, 7, 53),
(6510615024, 'Tse024', 'วนิดา เกษมสุข', 9, 5, 0, 2, 7, 5, 9, 9, 8, 1, 55),
(6510615025, 'Tse025', 'กรรณิการ์ บุญเลิศ', 7, 4, 2, 5, 7, 3, 9, 4, 10, 10, 61),
(6510615026, 'Tse026', 'รัฐพล เกรียงไกร', 0, 5, 1, 7, 2, 5, 0, 7, 10, 2, 39),
(6510615027, 'Tse027', 'สุวนันท์ ประเสริฐ', 0, 9, 9, 0, 0, 10, 2, 2, 1, 7, 40),
(6510615028, 'Tse028', 'วีระชัย สุขสวัสดิ์', 1, 8, 7, 4, 5, 10, 6, 7, 7, 0, 55),
(6510615029, 'Tse029', 'ปาริชาติ วิไลลักษณ์', 4, 2, 9, 10, 3, 7, 7, 7, 3, 3, 55),
(6510615030, 'Tse030', 'เกรียงศักดิ์ มงคล', 10, 0, 2, 10, 3, 2, 6, 1, 10, 10, 54),
(6510615031, 'Tse031', 'อรุณี รุ่งเรือง', 4, 2, 10, 6, 8, 9, 3, 9, 4, 2, 57),
(6510615032, 'Tse032', 'สุเมธ ทองแท้', 9, 4, 6, 1, 3, 3, 8, 9, 7, 4, 54),
(6510615033, 'Tse033', 'วราภรณ์ งามสม', 1, 9, 3, 10, 3, 2, 1, 2, 8, 1, 40),
(6510615034, 'Tse034', 'ธนกฤต วัฒนสุข', 5, 7, 0, 8, 6, 3, 2, 1, 1, 5, 38),
(6510615035, 'Tse035', 'กัลยาณี สุขเกษม', 0, 6, 5, 1, 8, 5, 2, 5, 0, 2, 34),
(6510615036, 'Tse036', 'ธีรพงศ์ วัฒนา', 3, 3, 2, 5, 1, 1, 0, 7, 6, 10, 38),
(6510615037, 'Tse037', 'สุดารัตน์ ใจกว้าง', 5, 2, 4, 2, 2, 2, 7, 5, 8, 5, 42),
(6510615038, 'Tse038', 'ภูวดล สูงส่ง', 2, 1, 4, 8, 9, 3, 8, 1, 0, 10, 46),
(6510615039, 'Tse039', 'รัตนาวดี ใสสะอาด', 1, 0, 0, 0, 6, 10, 7, 6, 5, 4, 39),
(6510615040, 'Tse040', 'สุรศักดิ์ แข็งแรง', 7, 9, 4, 0, 8, 5, 6, 8, 10, 7, 64),
(6510615041, 'Tse041', 'กมลวรรณ สุขใจ', 4, 10, 4, 2, 4, 5, 5, 5, 7, 8, 54),
(6510615042, 'Tse042', 'พงศกร มั่นคง', 10, 8, 4, 5, 8, 8, 2, 1, 4, 9, 59),
(6510615043, 'Tse043', 'อัจฉรา ฉลาดเลิศ', 10, 10, 5, 3, 5, 5, 9, 0, 5, 5, 57),
(6510615044, 'Tse044', 'วิสุทธิ์ เกื้อหนุน', 0, 0, 9, 1, 9, 10, 6, 4, 8, 8, 55),
(6510615045, 'Tse045', 'สุพัตรา ดีงาม', 7, 8, 1, 6, 9, 0, 10, 3, 3, 6, 53),
(6510615046, 'Tse046', 'ไพศาล สุขุม', 4, 9, 10, 5, 1, 8, 2, 4, 7, 6, 56),
(6510615047, 'Tse047', 'กานต์ธิดา นวลน้อง', 7, 7, 0, 7, 10, 8, 7, 3, 4, 7, 60),
(6510615048, 'Tse048', 'วัฒนา เกษมสุข', 2, 7, 3, 5, 5, 5, 5, 1, 10, 8, 51),
(6510615049, 'Tse049', 'อรทัย สดใส', 8, 7, 1, 8, 7, 6, 6, 4, 3, 2, 52),
(6510615050, 'Tse050', 'เกรียงไกร ชาญเชี่ยว', 7, 4, 6, 1, 8, 6, 2, 0, 10, 7, 51);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
